package ch05_modifier;
/*
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
		성 적 표
------------------------------------------------
	번호 이름	국어	영어	수학	총점	평균
------------------------------------------------
	1   정우성	90	80	95	265	88
	2   김하늘	100	80	95	275	91
	3   황정민	95	80	90	265	88
	4   강동원	95	90	99	284	94
	5   유아인	90      90      90     270     90
------------------------------------------------
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
* 위의 테이블을 작성하는 프로그램을 작성하시오 
*/
public class ScoreTable {

	public static void main(String[] args) {
		Ex01_modifier[] score = {new Ex01_modifier(1,"정우성",90,80,95),
								 new Ex01_modifier(2,"김하늘",70,92,80),
								 new Ex01_modifier(3,"황정민",65,78,98),
								 new Ex01_modifier(4,"강동원",91,54,50),
								 new Ex01_modifier(5,"유아인",88,82,67),};
		System.out.println("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■");
		System.out.println("\t\t성적표");
		System.out.println("-----------------------------------------");
		System.out.println("\t번호  이름  국어  영어  수학  총점  평균");
		for(Ex01_modifier s:score) {
			s.printTable();
		}
		System.out.println("-----------------------------------------");
		System.out.println("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■");
								
		}

	}
